In [ ]:
# Lista : Serie de elementos de diferente tipos mutables.
# tupla: Serie de elementos de diferente tipo inmutable.
# Diccionari: Serie de elementos con dos componentes(clave + Valor)
# Array : Serie de elementos de un mismo unico tipo de dato.

In [ ]:
# series ( array ) vs Numpy
# Dataframes ( Filas y Columnas ) # Indices y Nombres ()
# Paneles ( + 2 Dimensiones )

In [3]:
import pandas as pd

import pandas

from pandas import (
    read_csv,
    read_xml,
    read_excel
)

In [2]:
# Generar un dataframe a partir de una lista
data = [['Juan', 25], ['Pedro', 34], ['Luis', 45]]

# Asignar nombres y crear el dataframe:
df = pd.DataFrame(data, columns=['Nombre' , 'Edad'])

In [3]:
df

  Nombre  Edad
0   Juan    25
1  Pedro    34
2   Luis    45

In [4]:
# Leer un archivo CSV local
df = pd.read_csv('./utils/data/data.csv')

df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [5]:
# Leemos otro archivo que no tiene cabecera

df = pd.read_csv('./utils/data/data_without_header',
                 header= None,
                 names = ['Nombre', 'Edad', 'Ciudad']
                 )

df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [4]:
# leer un archivo sin extension, pero con un diferente separador
df = pd.read_csv('./utils/data/data',
                sep= '|'
                )

df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [5]:
df = pd.read_json('./utils/data/data.json')

df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

Metodos Dataframe

In [ ]:
df

In [6]:
# obtener estadisticas descripticas
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [7]:
# Listar top n elementos
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [8]:
# listar bottom n elementos(ultimos)
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [9]:
# Extraer columnas
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
# Otra funcion de agrupado (count)
df.count()

Acceder valores con Dataframe

In [11]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [12]:
# seleccionar una columna
df['ciudad']

# Seleccionar mas de una columna
df[['ciudad', 'edad']]

      ciudad  edad
0     Madrid    25
1  Barcelona    30
2    Sevilla    35

In [13]:
# Seleccionar una fila por su indice
print(df.loc[2])

print("#### \n ")
# Seleccionar multiples filas
print(df.loc[[0, 2]])

print("#### \n ")
#Seleccionar filas que cumpla con cierta condicionar
print(df[df['edad']>=30])

nombre      Pedro
edad           35
ciudad    Sevilla
Name: 2, dtype: object
####

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla
####

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

Agregacion

In [14]:
# Crear un dict con grupos y valores
data = {
    'Grupo': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Valor': [12, 20, 11, 25, 12, 10]
}

# creamos el datfame
df = pd.DataFrame(data)

# Promedio de valor por grupo
promedio_por_grupo = df.groupby('Grupo').mean()
print(promedio_por_grupo)

# Suma por valores
suma_por_grupo = df.groupby('Grupo').sum()
print(suma_por_grupo)

           Valor
Grupo
A      11.666667
B      18.333333
       Valor
Grupo
A         35
B         55

In [15]:
# leemos la data sin extension
df = pd.read_csv('./utils/data/data', sep='|')

df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [16]:
# NaN "Not a Numbre" ( calculos numericos faltantes)
# None Ausencia de valor
# Null "No existe en python" (java, c#, SQL, javascript)

# eliminar las filas que contienen valores desconocidos (NaN)
df_sin_na = df.dropna()
print(df_sin_na)

print ("\n ")

# Reemplazar valores desconocidos por default (NaN)
df_completo = df.fillna(value=0)
print(df_completo)

print ("\n ")
df_sin_na = df.dropna(subset=['ciudad'])
print(df_sin_na)

print ("\n ")
df_completo_final = df['edad'].fillna(value=0)
print(df_completo_final)

  nombre  edad     ciudad
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla


  nombre  edad     ciudad
0   Juan   0.0     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla


  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla


0     0.0
1    30.0
2    35.0
Name: edad, dtype: float64

Funciones en un datafram

In [17]:
# Dataframe ejemplo
data = {
    'A': [1, 2, 3, 4],
    'B': [6, 7, 8, 9]
}

df = pd.DataFrame(data)

In [18]:
# Calcular un nuevo campo que duplique el grupo "A"
df['A_doble'] = df['A'].apply(lambda x: x*2)

df

   A  B  A_doble
0  1  6        2
1  2  7        4
2  3  8        6
3  4  9        8

In [19]:
def multiplo2(x):
    return x*2


df['A_doble_2'] = df['A'].apply(multiplo2)

df

   A  B  A_doble  A_doble_2
0  1  6        2          2
1  2  7        4          4
2  3  8        6          6
3  4  9        8          8